// WidgetBlueprintGeneratedClass Card_Profile_LevelBoard.Card_Profile_LevelBoard_C
// Size: 0x2b0 (Inherited: 0x268)
struct UCard_Profile_LevelBoard_C : UPBUserWidget {
	struct UImage* BG; // 0x268(0x08)
	struct UTextBlock* CurrentExp; // 0x270(0x08)
	struct UTextBlock* CurrentLevel; // 0x278(0x08)
	struct UImage* Image_88; // 0x280(0x08)
	struct UImage* LevelImage; // 0x288(0x08)
	struct UTextBlock* lv; // 0x290(0x08)
	struct UTextBlock* PlayerName; // 0x298(0x08)
	struct UImage* ProgressBar_Exp; // 0x2a0(0x08)
	struct UTextBlock* TotalExp; // 0x2a8(0x08)
};

