// WidgetBlueprintGeneratedClass Card_Friend_SelectedDetail.Card_Friend_SelectedDetail_C
// Size: 0x2b0 (Inherited: 0x268)
struct UCard_Friend_SelectedDetail_C : UPBUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetAnimation* FocusOn; // 0x270(0x08)
	struct UImage* Image_67; // 0x278(0x08)
	struct UImage* Image_69; // 0x280(0x08)
	struct UImage* Image_70; // 0x288(0x08)
	struct UImage* Image_393; // 0x290(0x08)
	struct UImage* Image_395; // 0x298(0x08)
	struct UImage* Image_396; // 0x2a0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_121; // 0x2a8(0x08)

	void ExecuteUbergraph_Card_Friend_SelectedDetail(int32_t EntryPoint); // Function Card_Friend_SelectedDetail.Card_Friend_SelectedDetail_C.ExecuteUbergraph_Card_Friend_SelectedDetail // (Final|UbergraphFunction) // @ game+0x1556ec0
};

