// BlueprintGeneratedClass GAC_BP.GAC_BP_C
// Size: 0x2f90 (Inherited: 0x2b10)
struct AGAC_BP_C : APBCharacter_BP_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2b10(0x08)
	struct UPBSkeletalMeshComponent* HandRight; // 0x2b18(0x08)
	struct UPBSkeletalMeshComponent* HandLeft; // 0x2b20(0x08)
	struct UStaticMeshComponent* FlightControllerBase; // 0x2b28(0x08)
	struct UPBSkeletalMeshComponent* FlightController; // 0x2b30(0x08)
	struct UStaticMeshComponent* Mesh_St_Char_HelmetTest; // 0x2b38(0x08)
	struct UMaterialBillboardComponent* MaterialBillboard; // 0x2b40(0x08)
	struct USpringArmComponent* SpringArmHitDown; // 0x2b48(0x08)
	struct UPBDamageNormalComponent* PBDamageNormal; // 0x2b50(0x08)
	struct UPBDamageImpulseComponent* PBDamageImpulse; // 0x2b58(0x08)
	struct UPBDamageEMPComponent* PBDamageEMP; // 0x2b60(0x08)
	struct UPBDamageStunComponent* PBDamageStun; // 0x2b68(0x08)
	struct UComponent_DamageIndicator_C* Component_DamageIndicator; // 0x2b70(0x08)
	struct URingMenuComponent_C* RingMenuComponent; // 0x2b78(0x08)
	float RollOnSurface_UpdateRoll_B4B1307B40ADDC5B4EFB66A5FFF8DFCC; // 0x2b80(0x04)
	enum class ETimelineDirection RollOnSurface__Direction_B4B1307B40ADDC5B4EFB66A5FFF8DFCC; // 0x2b84(0x01)
	char pad_2B85[0x3]; // 0x2b85(0x03)
	struct UTimelineComponent* RollOnSurface; // 0x2b88(0x08)
	float RollFloating_UpdateRoll_2D805F6547C3CA8416240B9B18C93C2C; // 0x2b90(0x04)
	enum class ETimelineDirection RollFloating__Direction_2D805F6547C3CA8416240B9B18C93C2C; // 0x2b94(0x01)
	char pad_2B95[0x3]; // 0x2b95(0x03)
	struct UTimelineComponent* RollFloating; // 0x2b98(0x08)
	float Timeline_8_HookLaunchingTimeline_AB9F576B4660C9CC3A0EE8BD3E53DD65; // 0x2ba0(0x04)
	enum class ETimelineDirection Timeline_8__Direction_AB9F576B4660C9CC3A0EE8BD3E53DD65; // 0x2ba4(0x01)
	char pad_2BA5[0x3]; // 0x2ba5(0x03)
	struct UTimelineComponent* Timeline_9; // 0x2ba8(0x08)
	float Timeline_7_HookLaunchingTimeline_76F51AED40E71D7247E3FFA5C7592569; // 0x2bb0(0x04)
	enum class ETimelineDirection Timeline_7__Direction_76F51AED40E71D7247E3FFA5C7592569; // 0x2bb4(0x01)
	char pad_2BB5[0x3]; // 0x2bb5(0x03)
	struct UTimelineComponent* Timeline_8; // 0x2bb8(0x08)
	float Timeline_6_HookLaunchingTimeline_0B89A3FF42F73490639C99AD814FE3E8; // 0x2bc0(0x04)
	enum class ETimelineDirection Timeline_6__Direction_0B89A3FF42F73490639C99AD814FE3E8; // 0x2bc4(0x01)
	char pad_2BC5[0x3]; // 0x2bc5(0x03)
	struct UTimelineComponent* Timeline_7; // 0x2bc8(0x08)
	float Timeline_2_HookLaunchingTimeline_5BBC9F734B05BBB9EA7E24BF25EFB766; // 0x2bd0(0x04)
	enum class ETimelineDirection Timeline_2__Direction_5BBC9F734B05BBB9EA7E24BF25EFB766; // 0x2bd4(0x01)
	char pad_2BD5[0x3]; // 0x2bd5(0x03)
	struct UTimelineComponent* Timeline_3; // 0x2bd8(0x08)
	float Timeline_5_NewTrack_0_42028B39430E3BE9DB38888910B67AB5; // 0x2be0(0x04)
	enum class ETimelineDirection Timeline_5__Direction_42028B39430E3BE9DB38888910B67AB5; // 0x2be4(0x01)
	char pad_2BE5[0x3]; // 0x2be5(0x03)
	struct UTimelineComponent* Timeline_6; // 0x2be8(0x08)
	float Timeline_4_NewTrack_0_38E1FD744DD8BB232EB95C9781FD97F4; // 0x2bf0(0x04)
	enum class ETimelineDirection Timeline_4__Direction_38E1FD744DD8BB232EB95C9781FD97F4; // 0x2bf4(0x01)
	char pad_2BF5[0x3]; // 0x2bf5(0x03)
	struct UTimelineComponent* Timeline_5; // 0x2bf8(0x08)
	float RedColorTimeline_NewTrack_0_861FB0564A127B77588241BFB9DFB061; // 0x2c00(0x04)
	enum class ETimelineDirection RedColorTimeline__Direction_861FB0564A127B77588241BFB9DFB061; // 0x2c04(0x01)
	char pad_2C05[0x3]; // 0x2c05(0x03)
	struct UTimelineComponent* RedColorTimeline; // 0x2c08(0x08)
	struct FMulticastInlineDelegate ReinitWeapon; // 0x2c10(0x10)
	struct FMulticastInlineDelegate BroadcastWantToFire; // 0x2c20(0x10)
	struct FMulticastInlineDelegate BroadcastWantToADS; // 0x2c30(0x10)
	struct FMulticastInlineDelegate BroadcastCeaseFire; // 0x2c40(0x10)
	struct FMulticastInlineDelegate BroadcastCeaseADS; // 0x2c50(0x10)
	struct UCameraComponent* HackTarget; // 0x2c60(0x08)
	struct UAudioComponent* StunSound; // 0x2c68(0x08)
	bool ShoudShowHookLockHnit; // 0x2c70(0x01)
	char pad_2C71[0x3]; // 0x2c71(0x03)
	struct FVector RopeEndCache; // 0x2c74(0x0c)
	bool LaunchRope; // 0x2c80(0x01)
	char pad_2C81[0x3]; // 0x2c81(0x03)
	struct FVector RopeDeviationCache; // 0x2c84(0x0c)
	struct FTimerHandle GuidedRopeRandomTimer; // 0x2c90(0x08)
	bool HandRagdolling; // 0x2c98(0x01)
	char pad_2C99[0x3]; // 0x2c99(0x03)
	struct FName Lefthand; // 0x2c9c(0x08)
	struct FName RightHand; // 0x2ca4(0x08)
	char pad_2CAC[0x4]; // 0x2cac(0x04)
	struct ANiddle_BP_C* MyNiddleActor; // 0x2cb0(0x08)
	struct FTimerHandle HitDownCamreaControlTimer; // 0x2cb8(0x08)
	struct AMarkActor_C* Mark; // 0x2cc0(0x08)
	struct FHitResult MarkResault; // 0x2cc8(0x8c)
	char pad_2D54[0x4]; // 0x2d54(0x04)
	struct FTimerHandle TimerHandle_HitDownCamera; // 0x2d58(0x08)
	struct UParticleSystem* 3P_TakeEmp_VFX; // 0x2d60(0x08)
	struct UParticleSystemComponent* Emp3PLighting; // 0x2d68(0x08)
	struct UParticleSystemComponent* NewVar_6; // 0x2d70(0x08)
	struct UParticleSystemComponent* EMP_SmallFrac; // 0x2d78(0x08)
	struct UParticleSystemComponent* EmpFracVFX; // 0x2d80(0x08)
	struct FMulticastInlineDelegate BroadcastOnHitDown; // 0x2d88(0x10)
	struct FMulticastInlineDelegate BroadcastOnBeRescued; // 0x2d98(0x10)
	struct USetMouseInput_C* SetMouseSensitivity; // 0x2da8(0x08)
	struct ALauncherController_BP_C* LauncherController; // 0x2db0(0x08)
	struct TArray<struct FSlotSkinName> SkinInfoArray; // 0x2db8(0x10)
	struct TArray<enum class EPBSlotType> CharacterSkinArray; // 0x2dc8(0x10)
	struct FTimerHandle TimerHandle_StopMovement; // 0x2dd8(0x08)
	struct FTimerHandle TimerHandle_StartThreePersonCamera; // 0x2de0(0x08)
	struct FTimerHandle TimerHandle_StartKillCamera; // 0x2de8(0x08)
	struct TMap<enum class EPBSlotType, struct UMeshComponent*> SkinAddMesh3P; // 0x2df0(0x50)
	struct TMap<enum class EPBSlotType, struct UMeshComponent*> SkinAddMesh_1P; // 0x2e40(0x50)
	struct UMeshComponent* AddMesh; // 0x2e90(0x08)
	float MoveForward; // 0x2e98(0x04)
	float MoveRight; // 0x2e9c(0x04)
	float MoveUp; // 0x2ea0(0x04)
	float Roll; // 0x2ea4(0x04)
	int32_t MyControllerIDOnServer; // 0x2ea8(0x04)
	char pad_2EAC[0x4]; // 0x2eac(0x04)
	struct UMaterialInstanceDynamic* RecongintionEnhancement_MID; // 0x2eb0(0x08)
	struct FLinearColor RecongintionEnhancementColor; // 0x2eb8(0x10)
	struct FLinearColor OriginTeamColor; // 0x2ec8(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> PostMIDs; // 0x2ed8(0x10)
	bool MarkPointsTooClose; // 0x2ee8(0x01)
	char pad_2EE9[0x3]; // 0x2ee9(0x03)
	float MarkStartTime; // 0x2eec(0x04)
	bool HasMarkerFoundPoints; // 0x2ef0(0x01)
	char pad_2EF1[0x3]; // 0x2ef1(0x03)
	int32_t MarkPressState; // 0x2ef4(0x04)
	struct TArray<struct ABP_MechUAV_C*> MechUAVInViewArray; // 0x2ef8(0x10)
	bool IsInMechUAVVIew; // 0x2f08(0x01)
	char pad_2F09[0x3]; // 0x2f09(0x03)
	float RecoverSpeed; // 0x2f0c(0x04)
	float SingleFixScaler; // 0x2f10(0x04)
	float TogetherFixScaler; // 0x2f14(0x04)
	float RealFixScaler; // 0x2f18(0x04)
	char pad_2F1C[0x4]; // 0x2f1c(0x04)
	struct UBP_MechUAV_HUD_C* MechUAV_HUD; // 0x2f20(0x08)
	float RollScaler; // 0x2f28(0x04)
	char pad_2F2C[0x4]; // 0x2f2c(0x04)
	struct UNiagaraComponent* NS_CurrentHookRope; // 0x2f30(0x08)
	struct ACatchingModule_BP_C* CurrentCatchingModule; // 0x2f38(0x08)
	struct FTimerHandle Timer_UpdateRopeEndLoc; // 0x2f40(0x08)
	float MaxBeamCircleRadius; // 0x2f48(0x04)
	float LaunchingRotationPhace; // 0x2f4c(0x04)
	struct FTimerHandle Timer_UpdateRopeEndLoc_TP; // 0x2f50(0x08)
	struct UNiagaraComponent* NS_CurrentHookRope_TP; // 0x2f58(0x08)
	bool IsInOutlineCharacter; // 0x2f60(0x01)
	char pad_2F61[0x3]; // 0x2f61(0x03)
	struct FVector TranslateVector; // 0x2f64(0x0c)
	struct FVector RotateVector; // 0x2f70(0x0c)
	char pad_2F7C[0x4]; // 0x2f7c(0x04)
	struct ABubble_BP_C* HamsterBall; // 0x2f80(0x08)
	bool SpawnGodMode; // 0x2f88(0x01)
	char pad_2F89[0x3]; // 0x2f89(0x03)
	float SpawnGodMode_EMP_Cache; // 0x2f8c(0x04)

	void ChangeToSeeMesh(bool bSeeMesh3P); // Function GAC_BP.GAC_BP_C.ChangeToSeeMesh // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void DestroyHamsterBall(); // Function GAC_BP.GAC_BP_C.DestroyHamsterBall // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void HiddenHamsterBall(); // Function GAC_BP.GAC_BP_C.HiddenHamsterBall // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ShowHamsterBall(); // Function GAC_BP.GAC_BP_C.ShowHamsterBall // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void DisableBackPackAndBodyLight(); // Function GAC_BP.GAC_BP_C.DisableBackPackAndBodyLight // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void PlayMarkTargetSound(struct APBPlayerState* VisionPlayerState); // Function GAC_BP.GAC_BP_C.PlayMarkTargetSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
