// BlueprintGeneratedClass Instancing_CrossDot2m_10X10_BP.Instancing_CrossDot2m_10X10_BP_C
// Size: 0x264 (Inherited: 0x220)
struct AInstancing_CrossDot2m_10X10_BP_C : AActor {
	struct UInstancedStaticMeshComponent* InstancedStaticMesh; // 0x220(0x08)
	int32_t NumX; // 0x228(0x04)
	float DistanceX; // 0x22c(0x04)
	int32_t NumY; // 0x230(0x04)
	float DistanceY; // 0x234(0x04)
	int32_t NumZ; // 0x238(0x04)
	float DistanceZ; // 0x23c(0x04)
	struct FVector TransformLocationX; // 0x240(0x0c)
	struct FVector TransformLocationY; // 0x24c(0x0c)
	struct FVector TransformLocationZ; // 0x258(0x0c)

	void UserConstructionScript(); // Function Instancing_CrossDot2m_10X10_BP.Instancing_CrossDot2m_10X10_BP_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
};

