// WidgetBlueprintGeneratedClass MedalInfo.MedalInfo_C
// Size: 0x2a8 (Inherited: 0x268)
struct UMedalInfo_C : UPBUserWidget {
	struct UTextBlock* Description; // 0x268(0x08)
	struct UTextBlock* Exp; // 0x270(0x08)
	struct UImage* Image_115; // 0x278(0x08)
	struct UImage* Image_133; // 0x280(0x08)
	struct UImage* Image_231; // 0x288(0x08)
	struct UImage* Image_459; // 0x290(0x08)
	struct UImage* Medal_Image; // 0x298(0x08)
	struct UTextBlock* Name; // 0x2a0(0x08)

	void ShowMedalDetails(struct FFPB_MedalDetailsConfig_BP InMedalDetailsConfig); // Function MedalInfo.MedalInfo_C.ShowMedalDetails // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
};

