// AnimBlueprintGeneratedClass MKIII_TP_ABP.MKIII_TP_ABP_C
// Size: 0x3ec0 (Inherited: 0x3c0)
struct UMKIII_TP_ABP_C : UPBCharacterAnimInstance_TP {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x3c8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x3f8(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x510(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x668(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x690(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x6c0(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x7d8(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x930(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x958(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x980(0xe8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xa68(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xa90(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xb50(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xb80(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xba8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0xbd8(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0xc88(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xcb8(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xdd0(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xf28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xf50(0x28)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0xf78(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x1068(0xf0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1158(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1178(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x11a0(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3; // 0x11c0(0x1e0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x13a0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x13d0(0x28)
	char pad_13F8[0x8]; // 0x13f8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x1400(0x1e0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x15e0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1600(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x1620(0x1e0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1800(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x1830(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x18e0(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x1910(0x158)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x1a68(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x1b50(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x1c18(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1d00(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1de8(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x1eb0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1f78(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x2060(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x2090(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x2140(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x2168(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2230(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x2318(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x2348(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x23f8(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x2550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x2578(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x25a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2620(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2650(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x26d0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x2700(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x27b0(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2908(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2930(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2958(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2980(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x29a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x29d0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x2a50(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x2b18(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2b40(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2b70(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2b98(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x2c18(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x2ce0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2d08(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x2d38(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2d60(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x2d90(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x2e40(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x2f98(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x30f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x3118(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x3140(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x3188(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x3248(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x3290(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x32c0(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x3370(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x33b8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x33e0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x34a0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x34c8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x34f8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x35a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x3700(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x3728(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3770(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x37b8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x3800(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3848(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x3890(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x38d8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x3998(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x39c0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x39f0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3aa0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3bf8(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3c20(0x30)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x3c50(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x3d00(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x3db0(0xb0)
	struct AGAC_BP_C* castedGacBp; // 0x3e60(0x08)
	struct ACSTM_Base_C* CastedCurrentWeapon; // 0x3e68(0x08)
	float FatigueRate; // 0x3e70(0x04)
	struct FVector SightOffset_FromBP; // 0x3e74(0x0c)
	struct UAnimSequenceBase* HookAimingIdle; // 0x3e80(0x08)
	bool Stun?; // 0x3e88(0x01)
	char pad_3E89[0x7]; // 0x3e89(0x07)
	struct UAnimSequenceBase* StunPose; // 0x3e90(0x08)
	float StunBlendTime; // 0x3e98(0x04)
	bool LastStunState; // 0x3e9c(0x01)
	char pad_3E9D[0x3]; // 0x3e9d(0x03)
	struct UAnimMontage* IdleToStunMontage; // 0x3ea0(0x08)
	struct FRotator HelmetLayerOpenRotation; // 0x3ea8(0x0c)
	float FootWaveFloat; // 0x3eb4(0x04)
	bool InHookState; // 0x3eb8(0x01)
	enum class EPBHandsState CurrentHandState; // 0x3eb9(0x01)
	bool PlayStunMontage; // 0x3eba(0x01)
	bool FootOnWall; // 0x3ebb(0x01)
	float FootOnWallSpeed; // 0x3ebc(0x04)

	void FireAdditiveLayer(struct FPoseLink InBeforeFireAnim, struct FPoseLink FireAdditiveLayer); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.FireAdditiveLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnWallWalkBlend(struct FPoseLink InPose_AfterHandIK, struct FPoseLink OnWallWalkBlend); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.OnWallWalkBlend // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void HandIKLayer(struct FPoseLink InPose, struct FPoseLink HandIKLayer); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.HandIKLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BaseLayer(struct FPoseLink BaseLayer); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.BaseLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimGraph(struct FPoseLink AnimGraph); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnRep_PlayStunMontage(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.OnRep_PlayStunMontage // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_A42C60F547963F099635A9B0C7281ADE(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_A42C60F547963F099635A9B0C7281ADE // (BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_305E2E9D479B643FF72FDDB549334553(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_305E2E9D479B643FF72FDDB549334553 // (BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TwoWayBlend_9502384347597D55C5E1E0A77DB4DD2B(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TwoWayBlend_9502384347597D55C5E1E0A77DB4DD2B // (BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_BlendSpacePlayer_960A5F47489AB2FC21A6CC897394322B(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_BlendSpacePlayer_960A5F47489AB2FC21A6CC897394322B // (BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_889EB5F2402052FADF9B5FB2F286A63C(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_889EB5F2402052FADF9B5FB2F286A63C // (BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_2C73FDBC4664ECD1486BA6A5570B7023(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_TP_ABP_AnimGraphNode_TransitionResult_2C73FDBC4664ECD1486BA6A5570B7023 // (BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_AddAmmo(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_AddAmmo // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReloadFinished(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnReloadFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReadyToTakeOtherActions(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnReadyToTakeOtherActions // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnPostFireFinished(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnPostFireFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnEquipSkippable(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnEquipSkippable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReloadOneBullet(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnReloadOneBullet // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReloadOneBulletAnimFinished(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnReloadOneBulletAnimFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnTacReloadSkippable(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnTacReloadSkippable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnPostReloadSkippable(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnPostReloadSkippable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnPreReloadSkppable(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_OnPreReloadSkppable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_StartSaveSelf(); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.AnimNotify_StartSaveSelf // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_MKIII_TP_ABP(int32_t EntryPoint); // Function MKIII_TP_ABP.MKIII_TP_ABP_C.ExecuteUbergraph_MKIII_TP_ABP // (Final|UbergraphFunction) // @ game+0x1556ec0
};

