// AnimBlueprintGeneratedClass MKIII_UI_ABP.MKIII_UI_ABP_C
// Size: 0x3308 (Inherited: 0x2c0)
struct UMKIII_UI_ABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x2c8(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x3d0(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x528(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x630(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x738(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x840(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x998(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x9c0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xa88(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xb08(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xb30(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0xc88(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xd90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xe10(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xe90(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xfe8(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x1030(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1138(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x11b8(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1280(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1320(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1408(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1488(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x1528(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1630(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x16b0(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1778(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1818(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x18b8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x1938(0xc8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1a00(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x1a20(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1a40(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1b00(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1b80(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x1c00(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1d08(0x80)
	char pad_1D88[0x8]; // 0x1d88(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x1d90(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x1f70(0x1e0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2150(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2210(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2290(0x48)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_4; // 0x22d8(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x23c8(0xf0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x24b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x25c0(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x26c8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x2748(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2810(0x80)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2890(0x30)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x28c0(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x29b0(0xf0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x2aa0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2ba8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2cb0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2db8(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2dd8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2e98(0x80)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2f18(0x108)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3020(0xc8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x30e8(0x20)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x3108(0xc8)
	float DeltaTimeX; // 0x31d0(0x04)
	char pad_31D4[0x4]; // 0x31d4(0x04)
	struct ADisplayActor_C* Casted_UI_Actor; // 0x31d8(0x08)
	struct ACSTM_Base_C* CastedCurrentWeapon; // 0x31e0(0x08)
	struct FVector WeaponLocationOffset; // 0x31e8(0x0c)
	float ADS; // 0x31f4(0x04)
	struct FRotator WeaponRotationOffset; // 0x31f8(0x0c)
	float TimeToADS; // 0x3204(0x04)
	struct UAnimSequenceBase* PawnIdlePose; // 0x3208(0x08)
	struct UAnimSequenceBase* PawnADS_Pose; // 0x3210(0x08)
	struct FVector LocOffsetCache; // 0x3218(0x0c)
	struct FVector RotOffsetCache; // 0x3224(0x0c)
	float FatigueRate; // 0x3230(0x04)
	bool EquipTrigger; // 0x3234(0x01)
	bool DeployDirection; // 0x3235(0x01)
	char pad_3236[0x2]; // 0x3236(0x02)
	struct UAnimSequence* DeploySequence; // 0x3238(0x08)
	float EquipPlayRate; // 0x3240(0x04)
	float DeployPosition; // 0x3244(0x04)
	struct TArray<struct UAnimSequenceBase*> IdlePoses; // 0x3248(0x10)
	float SequenceLengthForRandomIdle; // 0x3258(0x04)
	float GameTimeLastRandomHappened; // 0x325c(0x04)
	bool GotNewWeapon; // 0x3260(0x01)
	char pad_3261[0x3]; // 0x3261(0x03)
	float ExtraIdleDelay; // 0x3264(0x04)
	struct FTimerHandle ExtraIdleTimerHandle; // 0x3268(0x08)
	bool PlayerInput; // 0x3270(0x01)
	char pad_3271[0x3]; // 0x3271(0x03)
	float FatiguePerShot; // 0x3274(0x04)
	struct FVector SightOffset_FromBP; // 0x3278(0x0c)
	float CurrentFov; // 0x3284(0x04)
	float WeaponOffsetScale; // 0x3288(0x04)
	float Direction; // 0x328c(0x04)
	float Speed; // 0x3290(0x04)
	float VertDir; // 0x3294(0x04)
	struct FVector AxisInputAcc; // 0x3298(0x0c)
	bool IsADS; // 0x32a4(0x01)
	char pad_32A5[0x3]; // 0x32a5(0x03)
	float UI_Ready; // 0x32a8(0x04)
	char pad_32AC[0x4]; // 0x32ac(0x04)
	struct UAnimSequenceBase* PawnIdleW1; // 0x32b0(0x08)
	struct UAnimSequenceBase* PawnIdleW2; // 0x32b8(0x08)
	struct FVector HelLoc; // 0x32c0(0x0c)
	bool DisHel; // 0x32cc(0x01)
	char pad_32CD[0x3]; // 0x32cd(0x03)
	struct UAnimSequenceBase* PawnIdleW1_New; // 0x32d0(0x08)
	struct UAnimSequenceBase* PawnIdleW2_New; // 0x32d8(0x08)
	float UI_BlendSpeed; // 0x32e0(0x04)
	bool UI_WeaponSwitch; // 0x32e4(0x01)
	bool UI_ModdingTac; // 0x32e5(0x01)
	char pad_32E6[0x2]; // 0x32e6(0x02)
	float LayerBlendPerBoneValue; // 0x32e8(0x04)
	float PlayUIReadyBlendWeight; // 0x32ec(0x04)
	float CopyHandLAlpha; // 0x32f0(0x04)
	float CopyHandRAlpha; // 0x32f4(0x04)
	struct FVector HeavyHeadAlpha; // 0x32f8(0x0c)
	float HelAlpha; // 0x3304(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetSightMesh1P(struct FVector Location); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.GetSightMesh1P // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void PlayExtraIdleAnim(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.PlayExtraIdleAnim // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void FatigueManagementFunc(float IncreaseAmount, float RecoverAmount, bool ShouldIncreaseFatigue, float CurrentFatigue); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.FatigueManagementFunc // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnPreReloadSkppable(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnPreReloadSkppable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnPostReloadSkippable(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnPostReloadSkippable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnTacReloadSkippable(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnTacReloadSkippable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReloadOneBulletAnimFinished(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnReloadOneBulletAnimFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnTacReloadFinished(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnTacReloadFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReloadOneBullet(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnReloadOneBullet // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnEquipSkippable(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnEquipSkippable // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_TriggerCheckReverse(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_TriggerCheckReverse // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnEquipFinished(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnEquipFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnUnequipFinished(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnUnequipFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnEquipStarted(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnEquipStarted // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnPostFireFinished(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnPostFireFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReadyToTakeOtherActions(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnReadyToTakeOtherActions // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_OnReloadFinished(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_OnReloadFinished // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void MontageEndStopReload(struct UAnimMontage* Montage, bool bInterrupted); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.MontageEndStopReload // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void WeaponShiftTimer(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.WeaponShiftTimer // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void AnimNotify_AddAmmo(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.AnimNotify_AddAmmo // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_UI_ABP_AnimGraphNode_SequencePlayer_2398D5F949C639A424CD119A7BF94DA0(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_UI_ABP_AnimGraphNode_SequencePlayer_2398D5F949C639A424CD119A7BF94DA0 // (BlueprintEvent) // @ game+0x1556ec0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_UI_ABP_AnimGraphNode_TwoWayBlend_A6D9951D48597C96EC5A91AD026B193E(); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MKIII_UI_ABP_AnimGraphNode_TwoWayBlend_A6D9951D48597C96EC5A91AD026B193E // (BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_MKIII_UI_ABP(int32_t EntryPoint); // Function MKIII_UI_ABP.MKIII_UI_ABP_C.ExecuteUbergraph_MKIII_UI_ABP // (Final|UbergraphFunction|HasDefaults) // @ game+0x1556ec0
};

