// UserDefinedStruct RingMenu_Struct.RingMenu_Struct
// Size: 0x58 (Inherited: 0x00)
struct FRingMenu_Struct {
	struct FName ID_5_58BF6A504C2B6035448A8CA403A90D26; // 0x00(0x08)
	struct FText ButtonName_18_BE4BD2E94C2064E3FF819FB24DBD7E3C; // 0x08(0x18)
	struct FText Description_19_5CC4BEEA493AC2CE430D3DB8A5C06280; // 0x20(0x18)
	struct UTexture2D* Image_12_EE106E2F47F8C646F1F552958C8B24B0; // 0x38(0x08)
	struct UTexture2D* CenterImage_14_E2AF035E450B60A336448291E091C91E; // 0x40(0x08)
	int32_t Slot_17_0F420573404437146CFD34B985D95BD0; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UMaterialInterface* Material_22_1316D0774FC8467402F75D88B7935466; // 0x50(0x08)
};

