// WidgetBlueprintGeneratedClass Setting.Setting_C
// Size: 0x774 (Inherited: 0x3d8)
struct USetting_C : UMainMenuWidget_Base_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3d8(0x08)
	struct UUMG_Card_BoolOption_C* BP_OpenMic; // 0x3e0(0x08)
	struct UUMG_Card_BoolOption_C* Card_SwitchOption_3; // 0x3e8(0x08)
	struct UScrollBox* DisplayList; // 0x3f0(0x08)
	struct UCard_ExtraOption_C* EO_CameraSensitivity; // 0x3f8(0x08)
	struct UCard_ExtraOption_C* EO_CameraSensitivityADS; // 0x400(0x08)
	struct UCard_ExtraOption_C* EO_Use; // 0x408(0x08)
	struct UCard_MainOption_C* Info; // 0x410(0x08)
	struct UCard_MainOption_C* Interaction; // 0x418(0x08)
	struct UCard_KeyBinding_C* KB_ActivateLeftSlotItem; // 0x420(0x08)
	struct UCard_KeyBinding_C* KB_ActivateRightSlotItem; // 0x428(0x08)
	struct UCard_KeyBinding_C* KB_AddAimSensitivity; // 0x430(0x08)
	struct UCard_KeyBinding_C* KB_AddCameraSensitivity; // 0x438(0x08)
	struct UCard_KeyBinding_C* KB_Aim; // 0x440(0x08)
	struct UCard_KeyBinding_C* KB_Fire; // 0x448(0x08)
	struct UCard_KeyBinding_C* KB_FixAirTightness; // 0x450(0x08)
	struct UCard_KeyBinding_C* KB_MainWeapon; // 0x458(0x08)
	struct UCard_KeyBinding_C* KB_ManuallyClimb; // 0x460(0x08)
	struct UCard_KeyBinding_C* KB_ManuallyDetach; // 0x468(0x08)
	struct UCard_KeyBinding_C* KB_Mark; // 0x470(0x08)
	struct UCard_KeyBinding_C* KB_Melee; // 0x478(0x08)
	struct UCard_KeyBinding_C* KB_MobilityModule; // 0x480(0x08)
	struct UCard_KeyBinding_C* KB_MoveBackward; // 0x488(0x08)
	struct UCard_KeyBinding_C* KB_MoveDown; // 0x490(0x08)
	struct UCard_KeyBinding_C* KB_MoveForward; // 0x498(0x08)
	struct UCard_KeyBinding_C* KB_MoveLeft; // 0x4a0(0x08)
	struct UCard_KeyBinding_C* KB_MoveRight; // 0x4a8(0x08)
	struct UCard_KeyBinding_C* KB_MoveUp; // 0x4b0(0x08)
	struct UCard_KeyBinding_C* KB_NextWeapon; // 0x4b8(0x08)
	struct UCard_KeyBinding_C* KB_PrepareCrabWeapon; // 0x4c0(0x08)
	struct UCard_KeyBinding_C* KB_PrevWeapon; // 0x4c8(0x08)
	struct UCard_KeyBinding_C* KB_QuestItem; // 0x4d0(0x08)
	struct UCard_KeyBinding_C* KB_QuickRespawn; // 0x4d8(0x08)
	struct UCard_KeyBinding_C* KB_ReduceAimSensitivity; // 0x4e0(0x08)
	struct UCard_KeyBinding_C* KB_ReduceCameraSensitivity; // 0x4e8(0x08)
	struct UCard_KeyBinding_C* KB_Reload; // 0x4f0(0x08)
	struct UCard_KeyBinding_C* KB_Replenish; // 0x4f8(0x08)
	struct UCard_KeyBinding_C* KB_RescueOther; // 0x500(0x08)
	struct UCard_KeyBinding_C* KB_RollLeft; // 0x508(0x08)
	struct UCard_KeyBinding_C* KB_RollRight; // 0x510(0x08)
	struct UCard_KeyBinding_C* KB_Run; // 0x518(0x08)
	struct UCard_KeyBinding_C* KB_Scoreboard; // 0x520(0x08)
	struct UCard_KeyBinding_C* KB_SecondWeapon; // 0x528(0x08)
	struct UCard_KeyBinding_C* KB_SwitchAllyCamera; // 0x530(0x08)
	struct UCard_KeyBinding_C* KB_Use; // 0x538(0x08)
	struct UCard_KeyBinding_C* KB_UseSkill; // 0x540(0x08)
	struct UUMG_Card_EnumOption_C* MO_AA; // 0x548(0x08)
	struct UUMG_Card_EnumOption_C* MO_AimMethod; // 0x550(0x08)
	struct UUMG_Card_EnumOption_C* MO_AutoCatchSurface; // 0x558(0x08)
	struct UUMG_Card_EnumOption_C* MO_BrakingMethod; // 0x560(0x08)
	struct UUMG_Card_EnumOption_C* MO_ColorDeficiency; // 0x568(0x08)
	struct UUMG_Card_EnumOption_C* MO_FRAMERATE; // 0x570(0x08)
	struct UUMG_Card_EnumOption_C* MO_Language; // 0x578(0x08)
	struct UUMG_Card_EnumOption_C* MO_ManuallyClimbInput; // 0x580(0x08)
	struct UUMG_Card_EnumOption_C* MO_ManuallyDetachInput; // 0x588(0x08)
	struct UUMG_Card_EnumOption_C* MO_MarkMethod; // 0x590(0x08)
	struct UUMG_Card_EnumOption_C* MO_RunMethod; // 0x598(0x08)
	struct UUMG_Card_EnumOption_C* MO_ScoreboardPopMethod; // 0x5a0(0x08)
	struct UUMG_Card_EnumOption_C* MO_ScreenResolution; // 0x5a8(0x08)
	struct UUMG_Card_EnumOption_C* MO_ShadowQuality; // 0x5b0(0x08)
	struct UUMG_Card_EnumOption_C* MO_TextureQuality; // 0x5b8(0x08)
	struct UUMG_Card_EnumOption_C* MO_Voice; // 0x5c0(0x08)
	struct UUMG_Card_EnumOption_C* MO_WindowMode; // 0x5c8(0x08)
	struct UCard_MainOption_C* Movement; // 0x5d0(0x08)
	struct UWidgetSwitcher* PageControlSwitcher; // 0x5d8(0x08)
	struct UPBWidgetSwitcher* PBWidgetSwitcher_MainContent; // 0x5e0(0x08)
	struct UUMG_Card_FloatOption_C* SL_AimSensitivity_X; // 0x5e8(0x08)
	struct UUMG_Card_FloatOption_C* SL_AimSensitivity_Y; // 0x5f0(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivity; // 0x5f8(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivity_X; // 0x600(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivity_Y; // 0x608(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivityADS; // 0x610(0x08)
	struct UUMG_Card_FloatOption_C* SL_ConversationVolumn; // 0x618(0x08)
	struct UUMG_Card_FloatOption_C* SL_EffectVolumn; // 0x620(0x08)
	struct UUMG_Card_FloatOption_C* SL_GammaValue; // 0x628(0x08)
	struct UUMG_Card_FloatOption_C* SL_HDRBrightness; // 0x630(0x08)
	struct UUMG_Card_FloatOption_C* SL_ImageEnhance; // 0x638(0x08)
	struct UUMG_Card_FloatOption_C* SL_MainVolumn; // 0x640(0x08)
	struct UUMG_Card_FloatOption_C* SL_MusicVolumn; // 0x648(0x08)
	struct UUMG_Card_BoolOption_C* SO_DOF; // 0x650(0x08)
	struct UUMG_Card_BoolOption_C* SO_ForceMarked; // 0x658(0x08)
	struct UUMG_Card_BoolOption_C* SO_InvertY; // 0x660(0x08)
	struct UUMG_Card_BoolOption_C* SO_MotionBlur; // 0x668(0x08)
	struct UUMG_Card_BoolOption_C* SO_VSync; // 0x670(0x08)
	struct UScrollBox* Sub_ScrollBoxForCameraSensitivityADS; // 0x678(0x08)
	struct UScrollBox* Sub_ScrollBoxForCameraSensivity; // 0x680(0x08)
	struct UScrollBox* Sub_ScrollBoxForUse; // 0x688(0x08)
	struct UCard_MainOption_C* System; // 0x690(0x08)
	struct UUMG_SubSetting_Controller_C* UMG_SubSetting_Controller; // 0x698(0x08)
	struct UUMG_Widget_Bottom_Panel_C* UMG_Widget_Bottom_Panel; // 0x6a0(0x08)
	struct UUMG_Widget_MainTitle_C* UMG_Widget_MainTitle; // 0x6a8(0x08)
	struct UUMG_Widget_SmallBaseTabSwitcher_C* UMG_Widget_SmallBaseTabSwitcher; // 0x6b0(0x08)
	struct UCard_MainOption_C* View; // 0x6b8(0x08)
	struct UCard_MainOption_C* Weapon; // 0x6c0(0x08)
	struct TArray<struct UCard_MainOption_C*> Tags; // 0x6c8(0x10)
	int32_t CurMiniTagInControlPage; // 0x6d8(0x04)
	int32_t ControlPageMenuLevel; // 0x6dc(0x04)
	struct APlayerController_BP_C* PC; // 0x6e0(0x08)
	struct UPB_GameInstance_C* GI; // 0x6e8(0x08)
	struct UPBPersistentUser_BP_C* PU; // 0x6f0(0x08)
	int32_t CurTab; // 0x6f8(0x04)
	char pad_6FC[0x4]; // 0x6fc(0x04)
	struct TArray<struct UCard_KeyBinding_C*> Interaction_SubKeys; // 0x700(0x10)
	struct TMap<struct FString, struct FText> Language_StrToText_Map; // 0x710(0x50)
	float GradientEdgeOpenHeight; // 0x760(0x04)
	float B_AlphaGradientValue; // 0x764(0x04)
	float T_AlphaGradientValue; // 0x768(0x04)
	float ExpandableChildDesiredSize; // 0x76c(0x04)
	int32_t HandlingPage; // 0x770(0x04)

	void RefreshScrollBoxOpacity(struct UScrollBox* InScrollBox, float CurrentOffset); // Function Setting.Setting_C.RefreshScrollBoxOpacity // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void SetScreenResolution(int32_t Dimension 1); // Function Setting.Setting_C.SetScreenResolution // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void InitScreenResolutionSetting(); // Function Setting.Setting_C.InitScreenResolutionSetting // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetChildrenDesiredSize(struct UPanelWidget* Parent, float ChildrenDesiredSize); // Function Setting.Setting_C.GetChildrenDesiredSize // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	struct FEventReply OnKeyDown(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function Setting.Setting_C.OnKeyDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetLanguageMapping(struct FString Language, struct FText OutText); // Function Setting.Setting_C.GetLanguageMapping // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	void SetMotionSensitivityADSPercentage(float InValue); // Function Setting.Setting_C.SetMotionSensitivityADSPercentage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetMotionSensitivityADSPercentage(); // Function Setting.Setting_C.GetMotionSensitivityADSPercentage // (Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	void SetMotionSensitivityPercentage(float InValue); // Function Setting.Setting_C.SetMotionSensitivityPercentage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetMotionSensitivityPercentage(); // Function Setting.Setting_C.GetMotionSensitivityPercentage // (Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	struct FEventReply GamepadBackKey(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function Setting.Setting_C.GamepadBackKey // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BindEvent(); // Function Setting.Setting_C.BindEvent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void InitGameplayGraph(); // Function Setting.Setting_C.InitGameplayGraph // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__MO_Language_K2Node_ComponentBoundEvent_0_OnChangeValue__DelegateSignature(int32_t NewIndex); // Function Setting.Setting_C.BndEvt__MO_Language_K2Node_ComponentBoundEvent_0_OnChangeValue__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void FocusGameplayList(); // Function Setting.Setting_C.FocusGameplayList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void Construct(); // Function Setting.Setting_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void InitDisplayList(); // Function Setting.Setting_C.InitDisplayList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void FocusDisplayList(); // Function Setting.Setting_C.FocusDisplayList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_HDRBrightness_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__SL_HDRBrightness_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__Setting_SL_ImageEnhance_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__Setting_SL_ImageEnhance_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void InitAudioList(); // Function Setting.Setting_C.InitAudioList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void FocusAudioList(); // Function Setting.Setting_C.FocusAudioList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_ConversationVolumn_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__SL_ConversationVolumn_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_EffectVolumn_K2Node_ComponentBoundEvent_1_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__SL_EffectVolumn_K2Node_ComponentBoundEvent_1_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_MainVolumn_K2Node_ComponentBoundEvent_2_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__SL_MainVolumn_K2Node_ComponentBoundEvent_2_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_MusicVolumn_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__SL_MusicVolumn_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SO_MotionSensitivity_K2Node_ComponentBoundEvent_2_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__SO_MotionSensitivity_K2Node_ComponentBoundEvent_2_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SO_MotionSensitivityADS_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature(float InNumber); // Function Setting.Setting_C.BndEvt__SO_MotionSensitivityADS_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SO_ForceMarked_K2Node_ComponentBoundEvent_10_OnChangeValue__DelegateSignature(bool NewValue); // Function Setting.Setting_C.BndEvt__SO_ForceMarked_K2Node_ComponentBoundEvent_10_OnChangeValue__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void InitControlList(); // Function Setting.Setting_C.InitControlList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void FocusControlList(); // Function Setting.Setting_C.FocusControlList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void EventOnSwichMiniTags(int32_t Index); // Function Setting.Setting_C.EventOnSwichMiniTags // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnTabsClicked(int32_t Index); // Function Setting.Setting_C.OnTabsClicked // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BackInControlPage(); // Function Setting.Setting_C.BackInControlPage // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnControlGraphMiniTagsFocus(struct UCard_MainOption_C* Caller); // Function Setting.Setting_C.OnControlGraphMiniTagsFocus // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__KB_Use_K2Node_ComponentBoundEvent_17_OnKeySet__DelegateSignature(); // Function Setting.Setting_C.BndEvt__KB_Use_K2Node_ComponentBoundEvent_17_OnKeySet__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__MO_RunMethod_K2Node_ComponentBoundEvent_18_OnChangeValue__DelegateSignature(int32_t NewIndex); // Function Setting.Setting_C.BndEvt__MO_RunMethod_K2Node_ComponentBoundEvent_18_OnChangeValue__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__QuitButton_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature(); // Function Setting.Setting_C.BndEvt__QuitButton_K2Node_ComponentBoundEvent_20_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void OnInitialized(); // Function Setting.Setting_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void OnTryToLeave(); // Function Setting.Setting_C.OnTryToLeave // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void HackToSwitchOnPlatform(); // Function Setting.Setting_C.HackToSwitchOnPlatform // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_Widget_SmallBaseTabSwitcher_K2Node_ComponentBoundEvent_1_OnTabSwitched__DelegateSignature(int32_t InTabIndex, int32_t OutTabIndex); // Function Setting.Setting_C.BndEvt__UMG_Widget_SmallBaseTabSwitcher_K2Node_ComponentBoundEvent_1_OnTabSwitched__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void OnSwitchOutOfTab(int32_t OutTab); // Function Setting.Setting_C.OnSwitchOutOfTab // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ConfirmToApplyAndSave(bool bConfirm); // Function Setting.Setting_C.ConfirmToApplyAndSave // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ConfirmToLeave(bool bConfirm); // Function Setting.Setting_C.ConfirmToLeave // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void TryReset(); // Function Setting.Setting_C.TryReset // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ConfirmToReset(bool bConfirm); // Function Setting.Setting_C.ConfirmToReset // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void TryToApply(int32_t HandlingPage); // Function Setting.Setting_C.TryToApply // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ShowOut(); // Function Setting.Setting_C.ShowOut // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ShowIn(); // Function Setting.Setting_C.ShowIn // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_Setting(int32_t EntryPoint); // Function Setting.Setting_C.ExecuteUbergraph_Setting // (Final|UbergraphFunction|HasDefaults) // @ game+0x1556ec0
};

