// UserDefinedStruct UI_ColorPalettes.UI_ColorPalettes
// Size: 0xa0 (Inherited: 0x00)
struct FUI_ColorPalettes {
	struct FLinearColor HighlightBlue_2_D529F917475111E1C11B37A8BF8014C7; // 0x00(0x10)
	struct FLinearColor HightOrange_14_875E507B4C0B6E0AC198B89C36508C01; // 0x10(0x10)
	struct FLinearColor PaleWhite_4_A44EC7154A2A108D07B8F28589D4B2F3; // 0x20(0x10)
	struct FLinearColor PaleBlack_8_D111547340381105F5CA4780D232E502; // 0x30(0x10)
	struct FLinearColor PaleWhite_Transparent_24_12289C664A266F3AFA874B9D2CE8C32C; // 0x40(0x10)
	struct FLinearColor PaleBlack_Transparent_23_8F9EB3D54783A49CB417A1A33F28120D; // 0x50(0x10)
	struct FLinearColor TrueWhite_16_3AF894E146FA84C16BEEE5B4E7299DD5; // 0x60(0x10)
	struct FLinearColor TrueBlack_18_CC1530B841D2956BC87B02BFBA65F027; // 0x70(0x10)
	struct FLinearColor Transparent_White_27_38DDCE434155D3E5994B069CDF49C7B2; // 0x80(0x10)
	struct FLinearColor Transparent_Black_28_C90A39C74AE8315204C676989554322A; // 0x90(0x10)
};

