// WidgetBlueprintGeneratedClass UMG_RoleDetails.UMG_RoleDetails_C
// Size: 0x2f8 (Inherited: 0x280)
struct UUMG_RoleDetails_C : UPBSingleRoleInfoWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	struct UWidgetAnimation* ShowDetailInfoBar; // 0x288(0x08)
	struct UImage* Image_77; // 0x290(0x08)
	struct UTextBlock* RoleLevelText; // 0x298(0x08)
	struct UTextBlock* RoleName; // 0x2a0(0x08)
	struct UImage* RoleSignImage; // 0x2a8(0x08)
	struct USkillUnit_C* SkillUnit; // 0x2b0(0x08)
	struct USkillUnit_C* SkillUnit_194; // 0x2b8(0x08)
	struct UUMG_CharBasicIntro_C* UMG_CharBasicIntro_121; // 0x2c0(0x08)
	struct UUMG_RoleAdminLog_C* UMG_RoleAdminLog_C_143; // 0x2c8(0x08)
	struct UUMG_RoleCareerEntrance_C* UMG_RoleCareerEntrance; // 0x2d0(0x08)
	struct UUMG_RoleCustomizeEntrance_C* UMG_RoleCustomizeEntrance; // 0x2d8(0x08)
	struct UUMG_RoleLevel_C* UMG_RoleLevel_105; // 0x2e0(0x08)
	struct UUMG_RoleListInArmory_C* UMG_RoleListInArmory; // 0x2e8(0x08)
	struct UUMG_RoleListTitleArmory_C* UMG_RoleListTitleArmory; // 0x2f0(0x08)

	void K2_SetRoleInfo(); // Function UMG_RoleDetails.UMG_RoleDetails_C.K2_SetRoleInfo // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_0_Btn_0_Clicked__DelegateSignature(); // Function UMG_RoleDetails.UMG_RoleDetails_C.BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_0_Btn_0_Clicked__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_1_Btn_1_Clicked__DelegateSignature(); // Function UMG_RoleDetails.UMG_RoleDetails_C.BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_1_Btn_1_Clicked__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_2_Btn_2_Clicked__DelegateSignature(); // Function UMG_RoleDetails.UMG_RoleDetails_C.BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_2_Btn_2_Clicked__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_3_Btn_0_Hoverd__DelegateSignature(); // Function UMG_RoleDetails.UMG_RoleDetails_C.BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_3_Btn_0_Hoverd__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_4_Btn_1_Hoverd__DelegateSignature(); // Function UMG_RoleDetails.UMG_RoleDetails_C.BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_4_Btn_1_Hoverd__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_5_Btn_2_Hoverd__DelegateSignature(); // Function UMG_RoleDetails.UMG_RoleDetails_C.BndEvt__UMG_RoleDetails_UMG_RoleListInArmory_K2Node_ComponentBoundEvent_5_Btn_2_Hoverd__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_RoleDetails(int32_t EntryPoint); // Function UMG_RoleDetails.UMG_RoleDetails_C.ExecuteUbergraph_UMG_RoleDetails // (Final|UbergraphFunction|HasDefaults) // @ game+0x1556ec0
};

