// WidgetBlueprintGeneratedClass UMG_RoleListTitleArmory.UMG_RoleListTitleArmory_C
// Size: 0x2d0 (Inherited: 0x260)
struct UUMG_RoleListTitleArmory_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UImage* Image_357; // 0x268(0x08)
	struct UTextBlock* LeftMark; // 0x270(0x08)
	struct UTextBlock* PageTitle; // 0x278(0x08)
	struct UTextBlock* RightMark; // 0x280(0x08)
	struct FText LM_Text; // 0x288(0x18)
	struct FText RM_Text; // 0x2a0(0x18)
	struct FText TitleText; // 0x2b8(0x18)

	void PreConstruct(bool IsDesignTime); // Function UMG_RoleListTitleArmory.UMG_RoleListTitleArmory_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_RoleListTitleArmory(int32_t EntryPoint); // Function UMG_RoleListTitleArmory.UMG_RoleListTitleArmory_C.ExecuteUbergraph_UMG_RoleListTitleArmory // (Final|UbergraphFunction) // @ game+0x1556ec0
};

