// WidgetBlueprintGeneratedClass UMG_CustomizeList.UMG_CustomizeList_C
// Size: 0x2f0 (Inherited: 0x268)
struct UUMG_CustomizeList_C : UPBUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetAnimation* Show; // 0x270(0x08)
	struct UUMG_RoleComponentTitle_C* C; // 0x278(0x08)
	struct UUMG_RoleComponent_C* C1; // 0x280(0x08)
	struct UUMG_RoleComponent_C* C2; // 0x288(0x08)
	struct UUMG_RoleComponent_C* C3; // 0x290(0x08)
	struct UUMG_RoleComponentTitle_C* D; // 0x298(0x08)
	struct UUMG_RoleComponent_C* D1; // 0x2a0(0x08)
	struct UUMG_RoleComponentTitle_C* E; // 0x2a8(0x08)
	struct UUMG_RoleComponent_C* E2; // 0x2b0(0x08)
	struct UUMG_RoleComponent_C* E3; // 0x2b8(0x08)
	struct UUMG_RoleComponentTitle_C* F; // 0x2c0(0x08)
	struct UUMG_RoleComponent_C* F1; // 0x2c8(0x08)
	struct UUMG_RoleComponent_C* F2; // 0x2d0(0x08)
	struct UUMG_RoleComponent_C* F3; // 0x2d8(0x08)
	struct UUMG_RoleComponent_C* F4; // 0x2e0(0x08)
	struct APBDisplayCharacter_BP_C* DispChar; // 0x2e8(0x08)

	void GetDispChar(bool Succeed, struct APBDisplayCharacter_BP_C* DispChar); // Function UMG_CustomizeList.UMG_CustomizeList_C.GetDispChar // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_C2_K2Node_ComponentBoundEvent_2_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_C2_K2Node_ComponentBoundEvent_2_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_C2_K2Node_ComponentBoundEvent_3_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_C2_K2Node_ComponentBoundEvent_3_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_C3_K2Node_ComponentBoundEvent_4_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_C3_K2Node_ComponentBoundEvent_4_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_C3_K2Node_ComponentBoundEvent_5_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_C3_K2Node_ComponentBoundEvent_5_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_D1_K2Node_ComponentBoundEvent_6_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_D1_K2Node_ComponentBoundEvent_6_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_D1_K2Node_ComponentBoundEvent_7_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_D1_K2Node_ComponentBoundEvent_7_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F1_K2Node_ComponentBoundEvent_10_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F1_K2Node_ComponentBoundEvent_10_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F1_K2Node_ComponentBoundEvent_11_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F1_K2Node_ComponentBoundEvent_11_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_E2_K2Node_ComponentBoundEvent_12_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_E2_K2Node_ComponentBoundEvent_12_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_E2_K2Node_ComponentBoundEvent_13_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_E2_K2Node_ComponentBoundEvent_13_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_E3_K2Node_ComponentBoundEvent_14_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_E3_K2Node_ComponentBoundEvent_14_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_E3_K2Node_ComponentBoundEvent_15_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_E3_K2Node_ComponentBoundEvent_15_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F2_K2Node_ComponentBoundEvent_16_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F2_K2Node_ComponentBoundEvent_16_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F3_K2Node_ComponentBoundEvent_17_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F3_K2Node_ComponentBoundEvent_17_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F2_K2Node_ComponentBoundEvent_18_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F2_K2Node_ComponentBoundEvent_18_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F3_K2Node_ComponentBoundEvent_19_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F3_K2Node_ComponentBoundEvent_19_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void Construct(); // Function UMG_CustomizeList.UMG_CustomizeList_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_UMG_RoleComponent_2_K2Node_ComponentBoundEvent_1_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_UMG_RoleComponent_2_K2Node_ComponentBoundEvent_1_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_UMG_RoleComponent_2_K2Node_ComponentBoundEvent_0_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_UMG_RoleComponent_2_K2Node_ComponentBoundEvent_0_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F4_K2Node_ComponentBoundEvent_8_Hovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F4_K2Node_ComponentBoundEvent_8_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_CustomizeList_F4_K2Node_ComponentBoundEvent_9_Unhovered__DelegateSignature(); // Function UMG_CustomizeList.UMG_CustomizeList_C.BndEvt__UMG_CustomizeList_F4_K2Node_ComponentBoundEvent_9_Unhovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_CustomizeList(int32_t EntryPoint); // Function UMG_CustomizeList.UMG_CustomizeList_C.ExecuteUbergraph_UMG_CustomizeList // (Final|UbergraphFunction) // @ game+0x1556ec0
};

