// WidgetBlueprintGeneratedClass UMG_SquadShortInfoInMainMenu.UMG_SquadShortInfoInMainMenu_C
// Size: 0x2e8 (Inherited: 0x2a0)
struct UUMG_SquadShortInfoInMainMenu_C : UPBSquadWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a0(0x08)
	struct UTextBlock* Text_FriendNum; // 0x2a8(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_1; // 0x2b0(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_2; // 0x2b8(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_3; // 0x2c0(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_4; // 0x2c8(0x08)
	struct UUMG_MemberDetailedInfo_C* UMG_MySelfIcon; // 0x2d0(0x08)
	struct UUMG_SquadHeader_C* UMG_SquadHeader; // 0x2d8(0x08)
	struct UUMG_UnderConstructionSign_C* UMG_UnderConstructionSign; // 0x2e0(0x08)

	void K2_SetSquadMember(); // Function UMG_SquadShortInfoInMainMenu.UMG_SquadShortInfoInMainMenu_C.K2_SetSquadMember // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_SquadShortInfoInMainMenu(int32_t EntryPoint); // Function UMG_SquadShortInfoInMainMenu.UMG_SquadShortInfoInMainMenu_C.ExecuteUbergraph_UMG_SquadShortInfoInMainMenu // (Final|UbergraphFunction) // @ game+0x1556ec0
};

