// WidgetBlueprintGeneratedClass UMG_SquadShortInfoInAssignment.UMG_SquadShortInfoInAssignment_C
// Size: 0x2e0 (Inherited: 0x2a0)
struct UUMG_SquadShortInfoInAssignment_C : UPBSquadWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a0(0x08)
	struct UHorizontalBox* MemberList; // 0x2a8(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_1; // 0x2b0(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_2; // 0x2b8(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_3; // 0x2c0(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_4; // 0x2c8(0x08)
	struct UUMG_SquadHeader_C* UMG_SquadHeader; // 0x2d0(0x08)
	struct UUMG_UnderConstructionSign_C* UMG_UnderConstructionSign; // 0x2d8(0x08)

	void K2_SetSquadMember(); // Function UMG_SquadShortInfoInAssignment.UMG_SquadShortInfoInAssignment_C.K2_SetSquadMember // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_SquadShortInfoInAssignment(int32_t EntryPoint); // Function UMG_SquadShortInfoInAssignment.UMG_SquadShortInfoInAssignment_C.ExecuteUbergraph_UMG_SquadShortInfoInAssignment // (Final|UbergraphFunction) // @ game+0x1556ec0
};

