// WidgetBlueprintGeneratedClass UMG_Setting.UMG_Setting_C
// Size: 0x634 (Inherited: 0x2a8)
struct UUMG_Setting_C : UUMG_PageBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a8(0x08)
	struct UUMG_Card_BoolOption_C* BP_OpenMic; // 0x2b0(0x08)
	struct UUMG_Card_BoolOption_C* Card_SwitchOption_3; // 0x2b8(0x08)
	struct UScrollBox* DisplayList; // 0x2c0(0x08)
	struct UCard_ExtraOption_C* EO_CameraSensitivity; // 0x2c8(0x08)
	struct UCard_ExtraOption_C* EO_CameraSensitivityADS; // 0x2d0(0x08)
	struct UCard_ExtraOption_C* EO_Use; // 0x2d8(0x08)
	struct UCard_MainOption_C* Info; // 0x2e0(0x08)
	struct UCard_MainOption_C* Interaction; // 0x2e8(0x08)
	struct UCard_KeyBinding_C* KB_ActivateLeftSlotItem; // 0x2f0(0x08)
	struct UCard_KeyBinding_C* KB_ActivateRightSlotItem; // 0x2f8(0x08)
	struct UCard_KeyBinding_C* KB_AddAimSensitivity; // 0x300(0x08)
	struct UCard_KeyBinding_C* KB_AddCameraSensitivity; // 0x308(0x08)
	struct UCard_KeyBinding_C* KB_Aim; // 0x310(0x08)
	struct UCard_KeyBinding_C* KB_Fire; // 0x318(0x08)
	struct UCard_KeyBinding_C* KB_FixAirTightness; // 0x320(0x08)
	struct UCard_KeyBinding_C* KB_MainWeapon; // 0x328(0x08)
	struct UCard_KeyBinding_C* KB_ManuallyClimb; // 0x330(0x08)
	struct UCard_KeyBinding_C* KB_ManuallyDetach; // 0x338(0x08)
	struct UCard_KeyBinding_C* KB_Mark; // 0x340(0x08)
	struct UCard_KeyBinding_C* KB_Melee; // 0x348(0x08)
	struct UCard_KeyBinding_C* KB_MobilityModule; // 0x350(0x08)
	struct UCard_KeyBinding_C* KB_MoveBackward; // 0x358(0x08)
	struct UCard_KeyBinding_C* KB_MoveDown; // 0x360(0x08)
	struct UCard_KeyBinding_C* KB_MoveForward; // 0x368(0x08)
	struct UCard_KeyBinding_C* KB_MoveLeft; // 0x370(0x08)
	struct UCard_KeyBinding_C* KB_MoveRight; // 0x378(0x08)
	struct UCard_KeyBinding_C* KB_MoveUp; // 0x380(0x08)
	struct UCard_KeyBinding_C* KB_NextWeapon; // 0x388(0x08)
	struct UCard_KeyBinding_C* KB_PrepareCrabWeapon; // 0x390(0x08)
	struct UCard_KeyBinding_C* KB_PrevWeapon; // 0x398(0x08)
	struct UCard_KeyBinding_C* KB_QuestItem; // 0x3a0(0x08)
	struct UCard_KeyBinding_C* KB_QuickRespawn; // 0x3a8(0x08)
	struct UCard_KeyBinding_C* KB_ReduceAimSensitivity; // 0x3b0(0x08)
	struct UCard_KeyBinding_C* KB_ReduceCameraSensitivity; // 0x3b8(0x08)
	struct UCard_KeyBinding_C* KB_Reload; // 0x3c0(0x08)
	struct UCard_KeyBinding_C* KB_Replenish; // 0x3c8(0x08)
	struct UCard_KeyBinding_C* KB_RescueOther; // 0x3d0(0x08)
	struct UCard_KeyBinding_C* KB_RollLeft; // 0x3d8(0x08)
	struct UCard_KeyBinding_C* KB_RollRight; // 0x3e0(0x08)
	struct UCard_KeyBinding_C* KB_Run; // 0x3e8(0x08)
	struct UCard_KeyBinding_C* KB_Scoreboard; // 0x3f0(0x08)
	struct UCard_KeyBinding_C* KB_SecondWeapon; // 0x3f8(0x08)
	struct UCard_KeyBinding_C* KB_SwitchAllyCamera; // 0x400(0x08)
	struct UCard_KeyBinding_C* KB_Use; // 0x408(0x08)
	struct UCard_KeyBinding_C* KB_UseSkill; // 0x410(0x08)
	struct UUMG_Card_EnumOption_C* MO_AA; // 0x418(0x08)
	struct UUMG_Card_EnumOption_C* MO_AimMethod; // 0x420(0x08)
	struct UUMG_Card_EnumOption_C* MO_AutoCatchSurface; // 0x428(0x08)
	struct UUMG_Card_EnumOption_C* MO_BrakingMethod; // 0x430(0x08)
	struct UUMG_Card_EnumOption_C* MO_ColorDeficiency; // 0x438(0x08)
	struct UUMG_Card_EnumOption_C* MO_FRAMERATE; // 0x440(0x08)
	struct UUMG_Card_EnumOption_C* MO_Language; // 0x448(0x08)
	struct UUMG_Card_EnumOption_C* MO_ManuallyClimbInput; // 0x450(0x08)
	struct UUMG_Card_EnumOption_C* MO_ManuallyDetachInput; // 0x458(0x08)
	struct UUMG_Card_EnumOption_C* MO_MarkMethod; // 0x460(0x08)
	struct UUMG_Card_EnumOption_C* MO_RunMethod; // 0x468(0x08)
	struct UUMG_Card_EnumOption_C* MO_ScoreboardPopMethod; // 0x470(0x08)
	struct UUMG_Card_EnumOption_C* MO_ScreenResolution; // 0x478(0x08)
	struct UUMG_Card_EnumOption_C* MO_ShadowQuality; // 0x480(0x08)
	struct UUMG_Card_EnumOption_C* MO_TextureQuality; // 0x488(0x08)
	struct UUMG_Card_EnumOption_C* MO_Voice; // 0x490(0x08)
	struct UUMG_Card_EnumOption_C* MO_WindowMode; // 0x498(0x08)
	struct UCard_MainOption_C* Movement; // 0x4a0(0x08)
	struct UWidgetSwitcher* PageControlSwitcher; // 0x4a8(0x08)
	struct UPBWidgetSwitcher* PBWidgetSwitcher_MainContent; // 0x4b0(0x08)
	struct UUMG_Card_FloatOption_C* SL_AimSensitivity_X; // 0x4b8(0x08)
	struct UUMG_Card_FloatOption_C* SL_AimSensitivity_Y; // 0x4c0(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivity; // 0x4c8(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivity_X; // 0x4d0(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivity_Y; // 0x4d8(0x08)
	struct UUMG_Card_FloatOption_C* SL_CameraSensitivityADS; // 0x4e0(0x08)
	struct UUMG_Card_FloatOption_C* SL_ConversationVolumn; // 0x4e8(0x08)
	struct UUMG_Card_FloatOption_C* SL_EffectVolumn; // 0x4f0(0x08)
	struct UUMG_Card_FloatOption_C* SL_GammaValue; // 0x4f8(0x08)
	struct UUMG_Card_FloatOption_C* SL_HDRBrightness; // 0x500(0x08)
	struct UUMG_Card_FloatOption_C* SL_ImageEnhance; // 0x508(0x08)
	struct UUMG_Card_FloatOption_C* SL_MainVolumn; // 0x510(0x08)
	struct UUMG_Card_FloatOption_C* SL_MusicVolumn; // 0x518(0x08)
	struct UUMG_Card_BoolOption_C* SO_DOF; // 0x520(0x08)
	struct UUMG_Card_BoolOption_C* SO_ForceMarked; // 0x528(0x08)
	struct UUMG_Card_BoolOption_C* SO_InvertY; // 0x530(0x08)
	struct UUMG_Card_BoolOption_C* SO_MotionBlur; // 0x538(0x08)
	struct UUMG_Card_BoolOption_C* SO_VSync; // 0x540(0x08)
	struct UScrollBox* Sub_ScrollBoxForCameraSensitivityADS; // 0x548(0x08)
	struct UScrollBox* Sub_ScrollBoxForCameraSensivity; // 0x550(0x08)
	struct UScrollBox* Sub_ScrollBoxForUse; // 0x558(0x08)
	struct UCard_MainOption_C* System; // 0x560(0x08)
	struct UUMG_SubSetting_Controller_C* UMG_SubSetting_Controller; // 0x568(0x08)
	struct UUMG_Widget_SmallBaseTabSwitcher_C* UMG_Widget_SmallBaseTabSwitcher; // 0x570(0x08)
	struct UCard_MainOption_C* View; // 0x578(0x08)
	struct UCard_MainOption_C* Weapon; // 0x580(0x08)
	struct TArray<struct UCard_MainOption_C*> Tags; // 0x588(0x10)
	int32_t CurMiniTagInControlPage; // 0x598(0x04)
	int32_t ControlPageMenuLevel; // 0x59c(0x04)
	struct APlayerController_BP_C* PC; // 0x5a0(0x08)
	struct UPB_GameInstance_C* GI; // 0x5a8(0x08)
	struct UPBPersistentUser_BP_C* PU; // 0x5b0(0x08)
	int32_t CurTab; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)
	struct TArray<struct UCard_KeyBinding_C*> Interaction_SubKeys; // 0x5c0(0x10)
	struct TMap<struct FString, struct FText> Language_StrToText_Map; // 0x5d0(0x50)
	float GradientEdgeOpenHeight; // 0x620(0x04)
	float B_AlphaGradientValue; // 0x624(0x04)
	float T_AlphaGradientValue; // 0x628(0x04)
	float ExpandableChildDesiredSize; // 0x62c(0x04)
	int32_t HandlingPage; // 0x630(0x04)

	void ResetChange(); // Function UMG_Setting.UMG_Setting_C.ResetChange // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void RefreshScrollBoxOpacity(struct UScrollBox* InScrollBox, float CurrentOffset); // Function UMG_Setting.UMG_Setting_C.RefreshScrollBoxOpacity // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void SetScreenResolution(int32_t Dimension 1); // Function UMG_Setting.UMG_Setting_C.SetScreenResolution // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void InitScreenResolutionSetting(); // Function UMG_Setting.UMG_Setting_C.InitScreenResolutionSetting // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetChildrenDesiredSize(struct UPanelWidget* Parent, float ChildrenDesiredSize); // Function UMG_Setting.UMG_Setting_C.GetChildrenDesiredSize // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetLanguageMapping(struct FString Language, struct FText OutText); // Function UMG_Setting.UMG_Setting_C.GetLanguageMapping // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	void SetMotionSensitivityADSPercentage(float InValue); // Function UMG_Setting.UMG_Setting_C.SetMotionSensitivityADSPercentage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetMotionSensitivityADSPercentage(); // Function UMG_Setting.UMG_Setting_C.GetMotionSensitivityADSPercentage // (Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	void SetMotionSensitivityPercentage(float InValue); // Function UMG_Setting.UMG_Setting_C.SetMotionSensitivityPercentage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetMotionSensitivityPercentage(); // Function UMG_Setting.UMG_Setting_C.GetMotionSensitivityPercentage // (Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	void BindEvent(); // Function UMG_Setting.UMG_Setting_C.BindEvent // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	struct FEventReply OnKeyDown(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function UMG_Setting.UMG_Setting_C.OnKeyDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void InitGameplayGraph(); // Function UMG_Setting.UMG_Setting_C.InitGameplayGraph // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__MO_Language_K2Node_ComponentBoundEvent_0_OnChangeValue__DelegateSignature(int32_t NewIndex); // Function UMG_Setting.UMG_Setting_C.BndEvt__MO_Language_K2Node_ComponentBoundEvent_0_OnChangeValue__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void FocusGameplayList(); // Function UMG_Setting.UMG_Setting_C.FocusGameplayList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void InitDisplayList(); // Function UMG_Setting.UMG_Setting_C.InitDisplayList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void FocusDisplayList(); // Function UMG_Setting.UMG_Setting_C.FocusDisplayList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_HDRBrightness_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature(float InNumber); // Function UMG_Setting.UMG_Setting_C.BndEvt__SL_HDRBrightness_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_Setting_SL_HDRBrightness_1_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature(float InNumber); // Function UMG_Setting.UMG_Setting_C.BndEvt__UMG_Setting_SL_HDRBrightness_1_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void InitAudioList(); // Function UMG_Setting.UMG_Setting_C.InitAudioList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void FocusAudioList(); // Function UMG_Setting.UMG_Setting_C.FocusAudioList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_ConversationVolumn_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature(float InNumber); // Function UMG_Setting.UMG_Setting_C.BndEvt__SL_ConversationVolumn_K2Node_ComponentBoundEvent_0_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_EffectVolumn_K2Node_ComponentBoundEvent_1_OnValueChange__DelegateSignature(float InNumber); // Function UMG_Setting.UMG_Setting_C.BndEvt__SL_EffectVolumn_K2Node_ComponentBoundEvent_1_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_MainVolumn_K2Node_ComponentBoundEvent_2_OnValueChange__DelegateSignature(float InNumber); // Function UMG_Setting.UMG_Setting_C.BndEvt__SL_MainVolumn_K2Node_ComponentBoundEvent_2_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SL_MusicVolumn_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature(float InNumber); // Function UMG_Setting.UMG_Setting_C.BndEvt__SL_MusicVolumn_K2Node_ComponentBoundEvent_3_OnValueChange__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__SO_ForceMarked_K2Node_ComponentBoundEvent_10_OnChangeValue__DelegateSignature(bool NewValue); // Function UMG_Setting.UMG_Setting_C.BndEvt__SO_ForceMarked_K2Node_ComponentBoundEvent_10_OnChangeValue__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void InitControlList(); // Function UMG_Setting.UMG_Setting_C.InitControlList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void FocusControlList(); // Function UMG_Setting.UMG_Setting_C.FocusControlList // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void EventOnSwichMiniTags(int32_t Index); // Function UMG_Setting.UMG_Setting_C.EventOnSwichMiniTags // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnTabsClicked(int32_t Index); // Function UMG_Setting.UMG_Setting_C.OnTabsClicked // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BackInControlPage(); // Function UMG_Setting.UMG_Setting_C.BackInControlPage // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnControlGraphMiniTagsFocus(struct UCard_MainOption_C* Caller); // Function UMG_Setting.UMG_Setting_C.OnControlGraphMiniTagsFocus // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__KB_Use_K2Node_ComponentBoundEvent_17_OnKeySet__DelegateSignature(); // Function UMG_Setting.UMG_Setting_C.BndEvt__KB_Use_K2Node_ComponentBoundEvent_17_OnKeySet__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__MO_RunMethod_K2Node_ComponentBoundEvent_18_OnChangeValue__DelegateSignature(int32_t NewIndex); // Function UMG_Setting.UMG_Setting_C.BndEvt__MO_RunMethod_K2Node_ComponentBoundEvent_18_OnChangeValue__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void OnInitialized(); // Function UMG_Setting.UMG_Setting_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void CustomEvent(); // Function UMG_Setting.UMG_Setting_C.CustomEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void CustomEvent_2(); // Function UMG_Setting.UMG_Setting_C.CustomEvent_2 // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnTryToLeave(); // Function UMG_Setting.UMG_Setting_C.OnTryToLeave // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void HackToSwitchOnPlatform(); // Function UMG_Setting.UMG_Setting_C.HackToSwitchOnPlatform // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_Widget_SmallBaseTabSwitcher_K2Node_ComponentBoundEvent_1_OnTabSwitched__DelegateSignature(int32_t InTabIndex, int32_t OutTabIndex); // Function UMG_Setting.UMG_Setting_C.BndEvt__UMG_Widget_SmallBaseTabSwitcher_K2Node_ComponentBoundEvent_1_OnTabSwitched__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void OnSwitchOutOfTab(int32_t OutTab); // Function UMG_Setting.UMG_Setting_C.OnSwitchOutOfTab // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ConfirmToApplyAndSave(bool bConfirm); // Function UMG_Setting.UMG_Setting_C.ConfirmToApplyAndSave // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ConfirmToLeave(bool bConfirm); // Function UMG_Setting.UMG_Setting_C.ConfirmToLeave // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void TryReset(); // Function UMG_Setting.UMG_Setting_C.TryReset // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ConfirmToReset(bool bConfirm); // Function UMG_Setting.UMG_Setting_C.ConfirmToReset // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void TryToApply(int32_t HandlingPage); // Function UMG_Setting.UMG_Setting_C.TryToApply // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void PreConstruct(bool IsDesignTime); // Function UMG_Setting.UMG_Setting_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void Construct(); // Function UMG_Setting.UMG_Setting_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void QuiSetting(int32_t HandlingPage); // Function UMG_Setting.UMG_Setting_C.QuiSetting // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void CustomEvent_3(bool bConfirm); // Function UMG_Setting.UMG_Setting_C.CustomEvent_3 // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_Setting(int32_t EntryPoint); // Function UMG_Setting.UMG_Setting_C.ExecuteUbergraph_UMG_Setting // (Final|UbergraphFunction|HasDefaults) // @ game+0x1556ec0
};

