// WidgetBlueprintGeneratedClass UMG_SquadShortInfoInArmory.UMG_SquadShortInfoInArmory_C
// Size: 0x2e0 (Inherited: 0x2a0)
struct UUMG_SquadShortInfoInArmory_C : UPBSquadWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a0(0x08)
	struct UHorizontalBox* MemberList; // 0x2a8(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon; // 0x2b0(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_1; // 0x2b8(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_6; // 0x2c0(0x08)
	struct UUMG_MemberIcon_C* UMG_MemberIcon_7; // 0x2c8(0x08)
	struct UUMG_SquadHeader_C* UMG_SquadHeader; // 0x2d0(0x08)
	struct UUMG_UnderConstructionSign_C* UMG_UnderConstructionSign; // 0x2d8(0x08)

	void K2_SetSquadMember(); // Function UMG_SquadShortInfoInArmory.UMG_SquadShortInfoInArmory_C.K2_SetSquadMember // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_SquadShortInfoInArmory(int32_t EntryPoint); // Function UMG_SquadShortInfoInArmory.UMG_SquadShortInfoInArmory_C.ExecuteUbergraph_UMG_SquadShortInfoInArmory // (Final|UbergraphFunction) // @ game+0x1556ec0
};

