// WidgetBlueprintGeneratedClass UMG_RoleCustomizeEntrance.UMG_RoleCustomizeEntrance_C
// Size: 0x320 (Inherited: 0x280)
struct UUMG_RoleCustomizeEntrance_C : UPBSingleRoleInfoWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x280(0x08)
	struct UWidgetAnimation* Refresh; // 0x288(0x08)
	struct UButton* CustomizeBtn; // 0x290(0x08)
	struct UImage* Image; // 0x298(0x08)
	struct UImage* Image_3; // 0x2a0(0x08)
	struct UImage* Image_4; // 0x2a8(0x08)
	struct UImage* Image_5; // 0x2b0(0x08)
	struct UImage* Image_7; // 0x2b8(0x08)
	struct UImage* Image_8; // 0x2c0(0x08)
	struct UImage* Image_9; // 0x2c8(0x08)
	struct UImage* Image_10; // 0x2d0(0x08)
	struct UImage* Image_11; // 0x2d8(0x08)
	struct UImage* Image_12; // 0x2e0(0x08)
	struct UImage* Image_357; // 0x2e8(0x08)
	struct UTextBlock* MainAbility; // 0x2f0(0x08)
	struct UImage* RoleIcon; // 0x2f8(0x08)
	struct UTextBlock* SecondAbility; // 0x300(0x08)
	struct UTextBlock* SecondAbility_2; // 0x308(0x08)
	struct UImage* SecondLevel; // 0x310(0x08)
	struct UImage* SecondLevel_2; // 0x318(0x08)

	void K2_SetRoleInfo(); // Function UMG_RoleCustomizeEntrance.UMG_RoleCustomizeEntrance_C.K2_SetRoleInfo // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_RoleCustomizeEntrance_CustomizeBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UMG_RoleCustomizeEntrance.UMG_RoleCustomizeEntrance_C.BndEvt__UMG_RoleCustomizeEntrance_CustomizeBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void PlayRefreshAnim(); // Function UMG_RoleCustomizeEntrance.UMG_RoleCustomizeEntrance_C.PlayRefreshAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_RoleCustomizeEntrance(int32_t EntryPoint); // Function UMG_RoleCustomizeEntrance.UMG_RoleCustomizeEntrance_C.ExecuteUbergraph_UMG_RoleCustomizeEntrance // (Final|UbergraphFunction|HasDefaults) // @ game+0x1556ec0
};

