// WidgetBlueprintGeneratedClass UMG_Role_SecondaryDetail.UMG_Role_SecondaryDetail_C
// Size: 0x2a8 (Inherited: 0x268)
struct UUMG_Role_SecondaryDetail_C : UPBUserWidget {
	struct UTextBlock* Content_2; // 0x268(0x08)
	struct UTextBlock* Content_3; // 0x270(0x08)
	struct UTextBlock* Content_4; // 0x278(0x08)
	struct UTextBlock* Content_1_Value; // 0x280(0x08)
	struct UTextBlock* Content_2_Value; // 0x288(0x08)
	struct UTextBlock* Content_3_Value; // 0x290(0x08)
	struct UTextBlock* Description; // 0x298(0x08)
	struct UTextBlock* Title; // 0x2a0(0x08)

	void GetDataStatisticsInfo(struct TMap<struct FName, int64_t> DataStatisticsInfo); // Function UMG_Role_SecondaryDetail.UMG_Role_SecondaryDetail_C.GetDataStatisticsInfo // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	void RefreshInfo(struct FName InRoleID); // Function UMG_Role_SecondaryDetail.UMG_Role_SecondaryDetail_C.RefreshInfo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
};

