// WidgetBlueprintGeneratedClass UMG_NewUnLockedItems.UMG_NewUnLockedItems_C
// Size: 0x640 (Inherited: 0x3d8)
struct UUMG_NewUnLockedItems_C : UMainMenuWidget_Base_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3d8(0x08)
	struct UConfirmPageButton_C* ConfirmPageButton_Yes; // 0x3e0(0x08)
	struct UTextBlock* CurrentIndex; // 0x3e8(0x08)
	struct UImage* Image_3; // 0x3f0(0x08)
	struct UImage* Image_110; // 0x3f8(0x08)
	struct UTextBlock* MaxCount; // 0x400(0x08)
	struct UScrollBox* ScrollBox_80; // 0x408(0x08)
	struct USizeBox* TRUE; // 0x410(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal; // 0x418(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_2; // 0x420(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_3; // 0x428(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_4; // 0x430(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_5; // 0x438(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_6; // 0x440(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_7; // 0x448(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_8; // 0x450(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_9; // 0x458(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_10; // 0x460(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_11; // 0x468(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_12; // 0x470(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_13; // 0x478(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_14; // 0x480(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_15; // 0x488(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_16; // 0x490(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17; // 0x498(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_18; // 0x4a0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_19; // 0x4a8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_20; // 0x4b0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_21; // 0x4b8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_22; // 0x4c0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_23; // 0x4c8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_24; // 0x4d0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_25; // 0x4d8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_26; // 0x4e0(0x08)
	struct UWrapBox* WrapBox_Challenge; // 0x4e8(0x08)
	struct TMap<struct FName, struct FFPB_MedalDetailsConfig_BP> MedalDetailsConfigMap; // 0x4f0(0x50)
	struct TMap<struct FName, int32_t> ObtainedMedalCountMap; // 0x540(0x50)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_1; // 0x590(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_2; // 0x598(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_3; // 0x5a0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_4; // 0x5a8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_5; // 0x5b0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_6; // 0x5b8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_7; // 0x5c0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_8; // 0x5c8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_9; // 0x5d0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_10; // 0x5d8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_11; // 0x5e0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_12; // 0x5e8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_13; // 0x5f0(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_14; // 0x5f8(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_15; // 0x600(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_16; // 0x608(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_17; // 0x610(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_18; // 0x618(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_19; // 0x620(0x08)
	struct UUMG_SingleMedal_C* UMG_SingleMedal_17_20; // 0x628(0x08)
	struct FMulticastInlineDelegate BtnClick; // 0x630(0x10)

	void SetMaxCount(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.SetMaxCount // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void SetCurrentIndex(int32_t InSerialNumber); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.SetCurrentIndex // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void ShowMedalDetails(struct FName InMedalID); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.ShowMedalDetails // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void SetDefaultFocus(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.SetDefaultFocus // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void RefreshInfo(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.RefreshInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void GetMedalsCount(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.GetMedalsCount // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void OnInitialized(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void LoadAssetsCompleteEvent(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.LoadAssetsCompleteEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_NewUnLockedItems_ConfirmPageButton_Yes_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.BndEvt__UMG_NewUnLockedItems_ConfirmPageButton_Yes_K2Node_ComponentBoundEvent_1_OnButtonPressed__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_NewUnLockedItems(int32_t EntryPoint); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.ExecuteUbergraph_UMG_NewUnLockedItems // (Final|UbergraphFunction|HasDefaults) // @ game+0x1556ec0
	void BtnClick__DelegateSignature(); // Function UMG_NewUnLockedItems.UMG_NewUnLockedItems_C.BtnClick__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
};

