// WidgetBlueprintGeneratedClass UMG_Mode_SecondaryDetail.UMG_Mode_SecondaryDetail_C
// Size: 0x2b8 (Inherited: 0x268)
struct UUMG_Mode_SecondaryDetail_C : UPBUserWidget {
	struct UTextBlock* Content_2; // 0x268(0x08)
	struct UTextBlock* Content_3; // 0x270(0x08)
	struct UTextBlock* Content_4; // 0x278(0x08)
	struct UTextBlock* Content_5; // 0x280(0x08)
	struct UTextBlock* Content_1_Value; // 0x288(0x08)
	struct UTextBlock* Content_2_Value; // 0x290(0x08)
	struct UTextBlock* Content_3_Value; // 0x298(0x08)
	struct UTextBlock* Content_4_Value; // 0x2a0(0x08)
	struct UTextBlock* Description; // 0x2a8(0x08)
	struct UTextBlock* Name; // 0x2b0(0x08)

	void RefreshInfo(struct FName InModeID); // Function UMG_Mode_SecondaryDetail.UMG_Mode_SecondaryDetail_C.RefreshInfo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1556ec0
};

