// WidgetBlueprintGeneratedClass UMG_MemberIcon.UMG_MemberIcon_C
// Size: 0x380 (Inherited: 0x2f8)
struct UUMG_MemberIcon_C : UPBMemberInfoWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2f8(0x08)
	struct UWidgetAnimation* ShowWIP; // 0x300(0x08)
	struct UButton* AddPlayerButton; // 0x308(0x08)
	struct UImage* frame; // 0x310(0x08)
	struct UImage* frame_2; // 0x318(0x08)
	struct UCanvasPanel* IconBoard; // 0x320(0x08)
	struct UImage* Image_2; // 0x328(0x08)
	struct UImage* Image_3; // 0x330(0x08)
	struct UImage* Image_207; // 0x338(0x08)
	struct UOverlay* InvitableBoard; // 0x340(0x08)
	struct UOverlay* LeaderBoard; // 0x348(0x08)
	struct UOverlay* LoadingBoard; // 0x350(0x08)
	struct UImage* LoadingImage; // 0x358(0x08)
	struct UWidgetSwitcher* MemberInfoSwitcher; // 0x360(0x08)
	struct UImage* PlayerInfoImage; // 0x368(0x08)
	struct UButton* ShowPlayerInfoButton; // 0x370(0x08)
	struct UButton* WIP_Btn; // 0x378(0x08)

	void Get Member Icon(struct UTexture2D* MemberIcon); // Function UMG_MemberIcon.UMG_MemberIcon_C.Get Member Icon // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1556ec0
	void BndEvt__UMG_MemberIcon_AddPlayerButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UMG_MemberIcon.UMG_MemberIcon_C.BndEvt__UMG_MemberIcon_AddPlayerButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_MemberIcon_ShowPlayerInfoButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function UMG_MemberIcon.UMG_MemberIcon_C.BndEvt__UMG_MemberIcon_ShowPlayerInfoButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_MemberIcon_AddPlayerButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature(); // Function UMG_MemberIcon.UMG_MemberIcon_C.BndEvt__UMG_MemberIcon_AddPlayerButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_MemberIcon_ShowPlayerInfoButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature(); // Function UMG_MemberIcon.UMG_MemberIcon_C.BndEvt__UMG_MemberIcon_ShowPlayerInfoButton_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void K2_SetMemberInfo(); // Function UMG_MemberIcon.UMG_MemberIcon_C.K2_SetMemberInfo // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_MemberIcon_WIP_Btn_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // Function UMG_MemberIcon.UMG_MemberIcon_C.BndEvt__UMG_MemberIcon_WIP_Btn_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_MemberIcon_WIP_Btn_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(); // Function UMG_MemberIcon.UMG_MemberIcon_C.BndEvt__UMG_MemberIcon_WIP_Btn_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_MemberIcon(int32_t EntryPoint); // Function UMG_MemberIcon.UMG_MemberIcon_C.ExecuteUbergraph_UMG_MemberIcon // (Final|UbergraphFunction) // @ game+0x1556ec0
};

