// WidgetBlueprintGeneratedClass UMG_AllPlayersSettle.UMG_AllPlayersSettle_C
// Size: 0x3a0 (Inherited: 0x2f8)
struct UUMG_AllPlayersSettle_C : UPBAllPlayerSettleWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2f8(0x08)
	struct UImage* Image_TeamA; // 0x300(0x08)
	struct UImage* Image_TeamA_Logo; // 0x308(0x08)
	struct UImage* Image_TeamB; // 0x310(0x08)
	struct UImage* Image_TeamB_Logo; // 0x318(0x08)
	struct UVerticalBox* TeamAList; // 0x320(0x08)
	struct UTextBlock* TeamAScore; // 0x328(0x08)
	struct UVerticalBox* TeamBList; // 0x330(0x08)
	struct UTextBlock* TeamBScore; // 0x338(0x08)
	struct UTextBlock* TeamNameA; // 0x340(0x08)
	struct UTextBlock* TeamNameB; // 0x348(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle; // 0x350(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_2; // 0x358(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_3; // 0x360(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_4; // 0x368(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_5; // 0x370(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_6; // 0x378(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_7; // 0x380(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_8; // 0x388(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_9; // 0x390(0x08)
	struct UUMG_SinglePlayerSettle_C* UMG_SinglePlayerSettle_10; // 0x398(0x08)

	void K2_SetAllPlayerInfo(); // Function UMG_AllPlayersSettle.UMG_AllPlayersSettle_C.K2_SetAllPlayerInfo // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_AllPlayersSettle(int32_t EntryPoint); // Function UMG_AllPlayersSettle.UMG_AllPlayersSettle_C.ExecuteUbergraph_UMG_AllPlayersSettle // (Final|UbergraphFunction|HasDefaults) // @ game+0x1556ec0
};

