// WidgetBlueprintGeneratedClass UMG_SquadMemberDetailInfo.UMG_SquadMemberDetailInfo_C
// Size: 0x2b0 (Inherited: 0x260)
struct UUMG_SquadMemberDetailInfo_C : UUserWidget {
	struct UOverlay* AvatarBoard; // 0x260(0x08)
	struct UButton* btn; // 0x268(0x08)
	struct UProgressBar* EXP_Progress; // 0x270(0x08)
	struct UImage* Image_Avatar; // 0x278(0x08)
	struct UImage* LevelIcon; // 0x280(0x08)
	struct UTextBlock* LevelText; // 0x288(0x08)
	struct UOverlay* LoadingBoard; // 0x290(0x08)
	struct UImage* MemberBGImage; // 0x298(0x08)
	struct UTextBlock* Num; // 0x2a0(0x08)
	struct UScrollText_C* ScrollText; // 0x2a8(0x08)
};

