// WidgetBlueprintGeneratedClass UMG_PersonalGameData.UMG_PersonalGameData_C
// Size: 0x430 (Inherited: 0x3c8)
struct UUMG_PersonalGameData_C : UPBPersonalDataWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3c8(0x08)
	struct UTextBlock* ACCText; // 0x3d0(0x08)
	struct UTextBlock* AKDText; // 0x3d8(0x08)
	struct UTextBlock* AssistsText; // 0x3e0(0x08)
	struct UTextBlock* DeathsText; // 0x3e8(0x08)
	struct UTextBlock* HeadShotText; // 0x3f0(0x08)
	struct UTextBlock* KDText; // 0x3f8(0x08)
	struct UTextBlock* KillsText; // 0x400(0x08)
	struct UTextBlock* KSText; // 0x408(0x08)
	struct UTextBlock* LKText; // 0x410(0x08)
	struct UVerticalBox* RightBox; // 0x418(0x08)
	struct UTextBlock* ScoreText; // 0x420(0x08)
	struct UTextBlock* SPMText; // 0x428(0x08)

	void K2_SetPlayerGameData(); // Function UMG_PersonalGameData.UMG_PersonalGameData_C.K2_SetPlayerGameData // (Event|Protected|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_PersonalGameData(int32_t EntryPoint); // Function UMG_PersonalGameData.UMG_PersonalGameData_C.ExecuteUbergraph_UMG_PersonalGameData // (Final|UbergraphFunction) // @ game+0x1556ec0
};

