// WidgetBlueprintGeneratedClass UMG_RoleCareerEntrance.UMG_RoleCareerEntrance_C
// Size: 0x2b8 (Inherited: 0x270)
struct UUMG_RoleCareerEntrance_C : UPBPageButtonWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	struct UButton* CareerBtn; // 0x278(0x08)
	struct UImage* Image; // 0x280(0x08)
	struct UImage* Image_2; // 0x288(0x08)
	struct UImage* Image_6; // 0x290(0x08)
	struct UImage* Image_7; // 0x298(0x08)
	struct UImage* Image_8; // 0x2a0(0x08)
	struct UImage* Image_357; // 0x2a8(0x08)
	struct UTextBlock* MainAbility_2; // 0x2b0(0x08)

	void BndEvt__UMG_RoleCareerEntrance_CareerBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UMG_RoleCareerEntrance.UMG_RoleCareerEntrance_C.BndEvt__UMG_RoleCareerEntrance_CareerBtn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_RoleCareerEntrance(int32_t EntryPoint); // Function UMG_RoleCareerEntrance.UMG_RoleCareerEntrance_C.ExecuteUbergraph_UMG_RoleCareerEntrance // (Final|UbergraphFunction) // @ game+0x1556ec0
};

