// WidgetBlueprintGeneratedClass UMG_FinalSettle.UMG_FinalSettle_C
// Size: 0x310 (Inherited: 0x2a8)
struct UUMG_FinalSettle_C : UUMG_PageBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2a8(0x08)
	struct UUMG_Profile_Button_C* Board; // 0x2b0(0x08)
	struct UPBWidgetSwitcher* ContentSwitcher; // 0x2b8(0x08)
	struct UUMG_Profile_Button_C* CREW; // 0x2c0(0x08)
	struct UUMG_Profile_Button_C* Highlights; // 0x2c8(0x08)
	struct UImage* Image_3; // 0x2d0(0x08)
	struct UImage* Image_110; // 0x2d8(0x08)
	struct UTextBlock* SquadName1; // 0x2e0(0x08)
	struct UTextBlock* SquadName2; // 0x2e8(0x08)
	struct UUMG_AllPlayersSettle_C* UMG_AllPlayerSettle; // 0x2f0(0x08)
	struct UUMG_MVPPlayerDisplay_C* UMG_MVPPlayerDisplay; // 0x2f8(0x08)
	struct UUMG_PersonalSettle_C* UMG_PersonalSettle; // 0x300(0x08)
	struct UUMG_SquadShortInfoInAssignment_C* UMG_SquadShortInfoInAssignment; // 0x308(0x08)

	void BndEvt__UMG_FinalSettle_UMG_Profile_Button_Crew_K2Node_ComponentBoundEvent_0_Btn_Hovered__DelegateSignature(); // Function UMG_FinalSettle.UMG_FinalSettle_C.BndEvt__UMG_FinalSettle_UMG_Profile_Button_Crew_K2Node_ComponentBoundEvent_0_Btn_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_FinalSettle_CREW_K2Node_ComponentBoundEvent_4_Btn_Hovered__DelegateSignature(); // Function UMG_FinalSettle.UMG_FinalSettle_C.BndEvt__UMG_FinalSettle_CREW_K2Node_ComponentBoundEvent_4_Btn_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void BndEvt__UMG_FinalSettle_HIGHLIGHTS_K2Node_ComponentBoundEvent_8_Btn_Hovered__DelegateSignature(); // Function UMG_FinalSettle.UMG_FinalSettle_C.BndEvt__UMG_FinalSettle_HIGHLIGHTS_K2Node_ComponentBoundEvent_8_Btn_Hovered__DelegateSignature // (BlueprintEvent) // @ game+0x1556ec0
	void Destruct(); // Function UMG_FinalSettle.UMG_FinalSettle_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_UMG_FinalSettle(int32_t EntryPoint); // Function UMG_FinalSettle.UMG_FinalSettle_C.ExecuteUbergraph_UMG_FinalSettle // (Final|UbergraphFunction) // @ game+0x1556ec0
};

