// WidgetBlueprintGeneratedClass WIPMark_A.WIPMark_A_C
// Size: 0x330 (Inherited: 0x268)
struct UWIPMark_A_C : UPBUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x268(0x08)
	struct UWidgetAnimation* HintHide; // 0x270(0x08)
	struct UCanvasPanel* CanvasPenel_LabelFrench_Text; // 0x278(0x08)
	struct UHorizontalBox* Hidden; // 0x280(0x08)
	struct UImage* Image_1; // 0x288(0x08)
	struct UImage* Image_6; // 0x290(0x08)
	struct UImage* Image_8; // 0x298(0x08)
	struct UImage* Image_114; // 0x2a0(0x08)
	struct UImage* Image_238; // 0x2a8(0x08)
	struct UPBInputTipsImage* Image_SpecialMoveButton; // 0x2b0(0x08)
	struct UPBInputTipsImage* PBInputTipsImage_1; // 0x2b8(0x08)
	struct UPBInputTipsImage* PBInputTipsImage_2; // 0x2c0(0x08)
	struct UPBInputTipsImage* PBInputTipsImage_3; // 0x2c8(0x08)
	struct UPBInputTipsImage* PBInputTipsImage_4; // 0x2d0(0x08)
	struct UPBInputTipsImage* PBInputTipsImage_6; // 0x2d8(0x08)
	struct UPBInputTipsImage* PBInputTipsImage_7; // 0x2e0(0x08)
	struct UHorizontalBox* Show; // 0x2e8(0x08)
	struct UHorizontalBox* T_EQP; // 0x2f0(0x08)
	struct UHorizontalBox* T_EQP_2; // 0x2f8(0x08)
	struct UHorizontalBox* T_EQP_3; // 0x300(0x08)
	struct UHorizontalBox* T_EQP_4; // 0x308(0x08)
	struct UHorizontalBox* T_EQP_5; // 0x310(0x08)
	struct UHorizontalBox* T_EQP_6; // 0x318(0x08)
	struct UHorizontalBox* T_EQP_7; // 0x320(0x08)
	struct UVerticalBox* TipsList; // 0x328(0x08)

	void Construct(); // Function WIPMark_A.WIPMark_A_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1556ec0
	void ExecuteUbergraph_WIPMark_A(int32_t EntryPoint); // Function WIPMark_A.WIPMark_A_C.ExecuteUbergraph_WIPMark_A // (Final|UbergraphFunction) // @ game+0x1556ec0
};

